console.log("주말고고고")


for (let i = 0; i < 10; i++) {

    if (i % 3 == 0){
        console.log(i);
        console.log ("선언 > 증가 > 비교 > 실행 ")
        }
}



// [컴파일 언어 vs 인터프리터 언어] 

    // 컴파일러 언어란? 
        // 프로그램 코드를 컴파일 해서, 컴퓨터가 알아들을 수 있는 기계어로 번역 해준다. 
        // 소스 코드 전체를 한번에 번역하고, 실행 파일을 만들어서 실행해준다. 

    // 장점
        // 파일의 크기가 큰데, 실행 속도가 빠르다. (번역을 한번에 쫙 해버리니까 빠름)
        // 전체 코드를 번역해서, 실행 전에, '오류를 미리' 알 수 있음.  
    // 단점 
        // 대신, 번역 과정이 조금 걸린다.  

    // 종류 
        // c, c++, java, python


        
    // 인터프리터 언어란? 

    // 종류 
        // 자바스크립트